#ifndef __IMOLOADER_H_
#define __IMOLOADER_H_



//-----------------------------------------------------------------------------------------
//
//	IMO読み取り用構造体
//
//-----------------------------------------------------------------------------------------
typedef struct tagIMOMeshVertex{
	DirectX::XMFLOAT3 pos;
	DirectX::XMFLOAT3 normal;
	DWORD	color;
	DirectX::XMFLOAT2 uv;
}IMOMESHVERTEX, *LPIMOMESHVERTEX;


//****************************************************************************************************
//
//	IMOLoader
//
//****************************************************************************************************
class IMOLoader
{
private:
	HANDLE m_file;
	
	DWORD m_vertexCount;		//	頂点数
	DWORD m_indexCount;			//	インデックス数
	DWORD m_faceCount;			//	面数
	DWORD m_materialCount;		//	マテリアル数

	LPIMOMESHVERTEX m_pVertices;	//	頂点情報
	LPDWORD m_pAttributes;			//	面のマテリアル番号
	LPWORD  m_pIndices;				//	インデックス情報

	char m_pTextures[32][MAX_PATH];	//	テクスチャ

	//------------------------------------------------------------------------------
	//
	//  @brief		メンバ変数の初期化
	//
	//------------------------------------------------------------------------------
	IMOLoader();
public:
	//------------------------------------------------------------------------------
	//
	//  @brief		IMOファイルを読み込む
	//	@param[in]	pFilePath	IMOファイルのパス
	//
	//------------------------------------------------------------------------------
	IMOLoader(const char* pFilePath);

	//------------------------------------------------------------------------------
	//
	//  @brief		メンバ変数を解放
	//
	//------------------------------------------------------------------------------
	~IMOLoader();

	//------------------------------------------------------------------------------
	//
	//  @brief		頂点数を取得
	//	@retrun		m_vertexCount
	//
	//------------------------------------------------------------------------------
	DWORD GetVertexCount()const;

	//------------------------------------------------------------------------------
	//
	//  @brief		インデックス数を取得
	//	@retrun		m_indexCount
	//
	//------------------------------------------------------------------------------
	DWORD GetIndexCount()const;

	//------------------------------------------------------------------------------
	//
	//  @brief		面数を取得
	//	@retrun		m_faceCount
	//
	//------------------------------------------------------------------------------
	DWORD GetFaceCount()const;

	//------------------------------------------------------------------------------
	//
	//  @brief		マテリアル数を取得
	//	@retrun		m_materialCount
	//
	//------------------------------------------------------------------------------
	DWORD GetMaterialCount()const;

	//------------------------------------------------------------------------------
	//
	//  @brief		属性データを取得
	//	@retrun		m_pAttributes
	//
	//------------------------------------------------------------------------------
	const LPDWORD GetAttributes()const;

	//------------------------------------------------------------------------------
	//
	//  @brief		インデックスデータを取得
	//	@retrun		m_pIndices
	//
	//------------------------------------------------------------------------------
	const LPWORD  GetIndices()const;

	//------------------------------------------------------------------------------
	//
	//  @brief		頂点データを取得
	//	@retrun		m_pVertices
	//
	//------------------------------------------------------------------------------
	const LPIMOMESHVERTEX GetVertices()const;

	//------------------------------------------------------------------------------
	//
	//  @brief		テクスチャパスを取得
	//	@retrun		m_pTextures
	//
	//------------------------------------------------------------------------------
	char (*GetTextures())[MAX_PATH];

private:
	//------------------------------------------------------------------------------
	//
	//  @brief		旧バージョンのIMOファイルを読み込む
	//
	//------------------------------------------------------------------------------
	void LoadVersion1();

	//------------------------------------------------------------------------------
	//
	//  @brief		新バージョンのIMOファイルを読み込む
	//
	//------------------------------------------------------------------------------
	void LoadVersion2();
	
	//------------------------------------------------------------------------------
	//
	//  @brief		ReadFileのラッパー
	//	@param[in]	pBuffer		データを取得
	//	@param[in]	dataSize	取得するデータサイズ
	//
	//------------------------------------------------------------------------------
	void ReadFile(LPVOID pBuffer, DWORD dataSize);
	
	//------------------------------------------------------------------------------
	//
	//  @brief		パスを分割する
	//	@param[out]	pSplitFilePath	分割したファイルパスが返る
	//	@param[in]	pFilepath		IMOLoader::IMOLoader(const char*)の引数
	//
	//------------------------------------------------------------------------------
	void SplitThePath(char pSplitFilePath[MAX_PATH],const char* pFilepath);

	//------------------------------------------------------------------------------
	//
	//  @brief		パスをm_pTexturesに登録する
	//	@param[in]	pSplitFilePath	分割したファイルパス
	//	@param[in]	imoTextures		IMO_OBJECT::textures
	//
	//------------------------------------------------------------------------------
	void BindPath(const char pSplitFilePath[MAX_PATH], const char imoTextures[32][32]);

};

#endif