#ifndef __BARRAGE_BEAM_H_
#define __BARRAGE_BEAM_H_

#include "BaseBarrage.h"
//****************************************************************************************************
//
//	弾幕　ビーム
//
//****************************************************************************************************
class BarrageBeam : public BaseBarrage
{
public:
	//------------------------------------------------------------------------------
	//
	//  @brief		引数付きコンストラクタ
	//  @param[in]	pFilepath	描画する2D画像のパス
	//	@param[in]	instanceNum 描画する2Dオブジェクの数
	//	@param[in]	renderSize	描画サイズ
	//
	//------------------------------------------------------------------------------
	BarrageBeam(const char* pFilepath, const UINT instanceNum, const DirectX::XMFLOAT2& renderSize);

	//------------------------------------------------------------------------------
	//
	//  @brief		更新
	//	@return		更新に失敗した場合、エラーと判断しゲームを終了する
	//
	//------------------------------------------------------------------------------
	bool DoUpdate();

	//------------------------------------------------------------------------------
	//
	//  @brief		描画
	//	@return		描画に失敗した場合、エラーと判断しゲームを終了する
	//
	//------------------------------------------------------------------------------
	bool DoRender();
private:
	//------------------------------------------------------------------------------
	//
	//  @brief		デフォルトコンストラクタ
	//
	//------------------------------------------------------------------------------
	BarrageBeam() {};
};

#endif // !__BARRAGE_BEAM_H_
