#include "DxLibrary\DX_Library.h"
#include "BarrageLaser.h"
using namespace DirectX;

//-----------------------------------------------------------------------------------------
//
//	引数付きコンストラクタ
//
//-----------------------------------------------------------------------------------------
BaseBarrage::BaseBarrage(const char* pFilepath, const UINT instanceNum, const XMFLOAT2& renderSize) :
	m_pInstance2D(new DX_Instance2DObject(pFilepath, instanceNum, renderSize)),
	m_instanecNum(instanceNum),
	m_bActive(false)
{
	m_pPotList = m_pInstance2D->GetPosList();
}

//-----------------------------------------------------------------------------------------
//
//	デフォルトコンストラクタ
//
//-----------------------------------------------------------------------------------------
BaseBarrage::~BaseBarrage()
{
	DELETE_OBJ(m_pInstance2D);
}

//-----------------------------------------------------------------------------------------
//
//	描画 子クラスで実装されている場合そちらを
//
//-----------------------------------------------------------------------------------------
bool BaseBarrage::DoRender()
{
	return m_pInstance2D->Render();
}

//-----------------------------------------------------------------------------------------
//
//	更新 子クラスで実装された更新関数を実行
//
//-----------------------------------------------------------------------------------------
bool BaseBarrage::Update()
{
	bool result = true;

	if (m_bActive)
	{
		result = DoUpdate();
	}

	return result;
}

//-----------------------------------------------------------------------------------------
//
//	描画 子クラスで実装された描画関数を実行
//
//-----------------------------------------------------------------------------------------
bool BaseBarrage::Render()
{
	bool result = true;

	if (m_bActive)
	{
		result = DoRender();
	}

	return result;
}


//-----------------------------------------------------------------------------------------
//
//  @brief		オブジェクトを無効化する
//
//-----------------------------------------------------------------------------------------
void BaseBarrage::Disable()
{
	m_bActive = false;
}

//-----------------------------------------------------------------------------------------
//
//  @brief		オブジェクトを有効化する
//
//-----------------------------------------------------------------------------------------
void BaseBarrage::Enable()
{
	m_bActive = true;
}

//-----------------------------------------------------------------------------------------
//
//  @brief		オブジェクトが有効かどうか
//
//-----------------------------------------------------------------------------------------
bool BaseBarrage::IsEnable() const
{
	return m_bActive;
}

//-----------------------------------------------------------------------------------------
//
//  @brief		オブジェクトが無効かどうか
//
//-----------------------------------------------------------------------------------------
bool BaseBarrage::IsDisable() const
{
	return !m_bActive;
}