#include	"DX_Library.h"

//-----------------------------------------------------------------------------------------
//
//	staticメンバ変数
//
//-----------------------------------------------------------------------------------------
dx_library::Scene*	DX_SceneManager::m_pCurScene = nullptr;
dx_library::Scene*	DX_SceneManager::m_pNextScene = nullptr;


//-----------------------------------------------------------------------------------------
//
//	メンバー変数を初期化する
//
//-----------------------------------------------------------------------------------------
void DX_SceneManager::Initialize(DX_Scene*	pCurScene)
{
	//	現在のシーンを設定
	m_pCurScene = pCurScene;
}

//-----------------------------------------------------------------------------------------
//
//	現在のシーンを取得する
//
//-----------------------------------------------------------------------------------------
dx_library::Scene* DX_SceneManager::GetCurScene()
{
	return m_pCurScene;
}