#ifndef __DX_SYSTEM_H_
#define __DX_SYSTEM_H_
	
//	作成するウィンドウのサイズを設定
enum class CREATE_WINDOW_SIZE : int{
	SCREEN_480p,	//	720		480
	SCREEN_720p,	//	1280	720
	SCREEN_1080p,	//	1920	1080
};

//****************************************************************************************************
//
//	System
//
//****************************************************************************************************
class System
{
private:
	static System* m_pInstnace;
	Microsoft::WRL::ComPtr<ID3D11Device> m_device;
	Microsoft::WRL::ComPtr<ID3D11DeviceContext> m_deviceContext;
	Microsoft::WRL::ComPtr<IDXGISwapChain> m_swapChain;
	Microsoft::WRL::ComPtr<ID3D11RenderTargetView> m_rtv;
	Microsoft::WRL::ComPtr<ID3D11DepthStencilView> m_dsv;
	Microsoft::WRL::ComPtr<ID3D11Texture2D> m_dsb;
	static D3D_FEATURE_LEVEL		m_featureLevel;
	static D3D_DRIVER_TYPE			m_driverType;
	static HWND						m_windowHandle;

	static unsigned int m_windowWidth;
	static unsigned int m_windowHeight;

	//------------------------------------------------------------------------------
	//
	//  @brief		何もしない
	//
	//------------------------------------------------------------------------------
	System();
public:
	//------------------------------------------------------------------------------
	//
	//  @brief		何もしない
	//
	//------------------------------------------------------------------------------
	~System();

	static System* GetInstance();
	//------------------------------------------------------------------------------
	//
	//  @brief		Deviceなどの生成を行う
	//	@param[in]	hwnd	DX_Framework::GetHwnd()
	//
	//------------------------------------------------------------------------------
	bool InitD3D(
		const HWND& hWnd
		);

	//------------------------------------------------------------------------------
	//
	//  @brief		Deviceなどを解放する
	//
	//------------------------------------------------------------------------------
	static void Release();

	//------------------------------------------------------------------------------
	//
	//  @brief		ウィンドウのサイズを設定
	//	@param[in]	windowSize	CREATE_WINDOW_SIZE定数
	//
	//------------------------------------------------------------------------------
	void SetWindowsSize(
		dx_library::CREATE_WINDOW_SIZE windowSize
		);

	//------------------------------------------------------------------------------
	//
	//  @brief		ウィンドウの高さを取得
	//	@return		m_windowHeight
	//
	//------------------------------------------------------------------------------
	static unsigned int GetWindowHeight();

	//------------------------------------------------------------------------------
	//
	//  @brief		ウィンドウの幅を取得
	//	@return		m_windowWidth
	//
	//------------------------------------------------------------------------------
	static unsigned int GetWindowWidth();
	
	//------------------------------------------------------------------------------
	//
	//  @brief		デバイスを取得
	//	@return		m_pDevice
	//
	//------------------------------------------------------------------------------
	ID3D11Device*	GetDevice() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		デバイスコンテキストを取得
	//	@return		m_pDeviceContext
	//
	//------------------------------------------------------------------------------
	ID3D11DeviceContext*	GetDeviceContext() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		スワップチェインを取得
	//	@return		m_pSwapChain
	//
	//------------------------------------------------------------------------------
	IDXGISwapChain*	GetSwapChain() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		FeatureLevelを取得
	//	@return		m_featureLevel
	//
	//------------------------------------------------------------------------------
	D3D_FEATURE_LEVEL GetFeatureLevel();
	
	//------------------------------------------------------------------------------
	//
	//  @brief		DriverTypeを取得
	//	@return		m_driverType
	//
	//------------------------------------------------------------------------------
	D3D_DRIVER_TYPE GetDriverType();

	//------------------------------------------------------------------------------
	//
	//  @brief		レンダーターゲットを取得
	//	@return		m_pRenderTargetView
	//
	//------------------------------------------------------------------------------
	ID3D11RenderTargetView*  GetDefaultRenderTargetView() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		深度･ステンシルビュー取得
	//	@return		m_pDepthStencilview
	//
	//------------------------------------------------------------------------------
	ID3D11DepthStencilView* 	GetDefaultDepthStencilView() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		深度･ステンシルバッファを取得
	//	@return		m_pDepthStencilbuffer
	//
	//------------------------------------------------------------------------------
	ID3D11Texture2D*		GetDepthStencilBuffer() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		ウィンドウハンドルを取得
	//	@return		m_windowHandle
	//
	//------------------------------------------------------------------------------
	 HWND	GetWindowHandle();

private:
	void CreateDevice();
	//------------------------------------------------------------------------------
	//
	//  @brief		SwapChain,ID3D11Device,ID3D11DeviceContextを作成
	//	@param[in]	hWnd	DX_Framework::GetHwnd()
	//
	//------------------------------------------------------------------------------
	void CreateSwapChain(
		const HWND& hWnd
		);

	//------------------------------------------------------------------------------
	//
	//  @brief		レンデーターゲットビューを作成
	//
	//------------------------------------------------------------------------------
	void CreateRenderTargetView();

	//------------------------------------------------------------------------------
	//
	//  @brief		深度･ステンシルバッファを作成する
	//
	//------------------------------------------------------------------------------
	void CreateDepthStencilBuffer();

	//------------------------------------------------------------------------------
	//
	//  @brief		深度･ステンシルビューを作成
	//
	//------------------------------------------------------------------------------
	void CreateDepthStencilView();

};
#endif // !__DX_SYSTEM_H_
