#ifndef __BASE_BARRAGE_H_
#define __BASE_BARRAGE_H_

//****************************************************************************************************
//
//	弾幕クラスの基底クラス
//
//****************************************************************************************************
class BaseBarrage
{
public:
	//------------------------------------------------------------------------------
	//
	//  @brief		デストラクタ
	//
	//------------------------------------------------------------------------------
	virtual ~BaseBarrage();

	//------------------------------------------------------------------------------
	//
	//  @brief		引数付きコンストラクタ
	//  @param[in]	pFilepath	描画する2D画像のパス
	//	@param[in]	instanceNum 描画する2Dオブジェクの数
	//	@param[in]	renderSize	描画サイズ
	//
	//------------------------------------------------------------------------------
	BaseBarrage(const char* pFilepath, const size_t instanceNum, const DirectX::XMFLOAT2& renderSize);

	//------------------------------------------------------------------------------
	//
	//  @brief		更新処理の純粋仮想関数　子クラスで実装してね
	//
	//------------------------------------------------------------------------------
	virtual void Update() = 0;

	//------------------------------------------------------------------------------
	//
	//  @brief		描画のみを行っている
	//
	//------------------------------------------------------------------------------
	virtual void Render();

protected:
	//------------------------------------------------------------------------------
	//
	//  @brief		デフォルトコンストラクタ
	//
	//------------------------------------------------------------------------------
	BaseBarrage() {};

	// インスタンス2Dオブジェクト
	DX_Instance2DObject* m_pInstance2D;

	// インスタンス2Dオブジェクトの座標一覧
	DirectX::XMFLOAT3* m_pPotList;

	// インスタンス数
	size_t m_instanecNum;
};

#endif // !__BASE_BARRAGE_H_
