#ifndef _BULLETMANAGER_H_
#define _BULLETMANAGER_H_
class CircularBarrage;

//****************************************************************************************************
//
//	BulletManager Class
//
//****************************************************************************************************
class CircularBarrageManager
{
private:
	static const int CIRCULARBARRAGE_MAX = 30;

	DX_2DObject* circle;

	// 弾画像リスト
	CircularBarrage* circularBarrageList[CircularBarrageManager::CIRCULARBARRAGE_MAX];

	DX_Instance2DObject* m_pInstance2d;
	// 弾有効化インターバル
	int interval;

	// 有効化する弾のインデックス
	int enabledBulletIndex;

public:
	//------------------------------------------------------------------------------
	//
	//  @brief		初期化
	//
	//------------------------------------------------------------------------------
	CircularBarrageManager();

	//------------------------------------------------------------------------------
	//
	//  @brief		解放
	//
	//------------------------------------------------------------------------------
	~CircularBarrageManager();

	//------------------------------------------------------------------------------
	//
	//  @brief		更新
	//
	//------------------------------------------------------------------------------
	void Update();

	//------------------------------------------------------------------------------
	//
	//  @brief		描画
	//
	//------------------------------------------------------------------------------
	void Render();
};

#endif