#ifndef __DX_2DOBJECT_H_
#define __DX_2DOBJECT_H_


//****************************************************************************************************
//
//	Object2D
//
//****************************************************************************************************
class DX_2DObject : public DX_GameObject
{
public:
	//------------------------------------------------------------------------------
	//
	//  @brief		メンバー変数の初期化
	//
	//------------------------------------------------------------------------------
	DX_2DObject();

	//------------------------------------------------------------------------------
	//
	//  @brief		m_pShaderResourceViewを解放
	//
	//------------------------------------------------------------------------------
	~DX_2DObject();

	//------------------------------------------------------------------------------
	//
	//  @brief		テクスチャ読み込みと頂点バッファの作成を行う。
	//	@param[in]	pFilepath	テクスチャのファイルパス
	//	@return		どちらかの作成に失敗でfalse
	//
	//------------------------------------------------------------------------------
	bool Initialize(const char* pFilepath);

	//------------------------------------------------------------------------------
	//
	//  @brief		テクスチャの高さを取得する
	//
	//------------------------------------------------------------------------------
	unsigned int GetHeight()const;

	//------------------------------------------------------------------------------
	//
	//  @brief		テクスチャの幅を取得する
	//
	//------------------------------------------------------------------------------
	unsigned int GetWidth()const;

	//------------------------------------------------------------------------------
	//
	//  @brief		全画面に描画
	//
	//------------------------------------------------------------------------------
	bool Render();

	//------------------------------------------------------------------------------
	//
	//  @brief		指定した範囲に描画
	//	@param[in]	renderPos	描画する範囲
	//
	//------------------------------------------------------------------------------
	bool Render(const DX::tagRect& renderPos);
	
	//------------------------------------------------------------------------------
	//
	//  @brief		指定した範囲、指定した画像座標で描画
	//	@param[in]	renderPos	描画する範囲
	//	@param[in]	texturePos	描画する画像の範囲
	//
	//------------------------------------------------------------------------------
	bool Render(const DX::tagRect& renderPos,const DX::tagRect& texturePos);

	//------------------------------------------------------------------------------
	//
	//  @brief		指定した範囲、指定した画像座標で描画
	//	@param[in]	renderPos	描画する範囲
	//	@param[in]	renderSize	描画する画像のサイズ
	//
	//------------------------------------------------------------------------------
	bool Render(const DirectX::XMFLOAT2& renderPos, const DirectX::XMFLOAT2& renderSize);

	//------------------------------------------------------------------------------
	//
	//  @brief		指定した範囲で描画する
	//	@param[in]	left	左
	//	@param[in]	top		上
	//	@param[in]	right	右
	//	@param[in]	bottom	下
	//
	//------------------------------------------------------------------------------
	bool Render(const float left, const float top, const float right, const float bottom, bool isMirror = false);

	//------------------------------------------------------------------------------
	//
	//  @brief		複製する
	//	@return		複製したオブジェクト
	//
	//------------------------------------------------------------------------------
	DX_2DObject* Clone();

	//------------------------------------------------------------------------------
	//
	//  @brief		オブジェクトが複製したものかどうか
	//	@return		オブジェクトが複製したものならtrue
	//
	//------------------------------------------------------------------------------
	bool IsClone() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		オブジェクトがオリジナルかどうか
	//	@return		オブジェクトがオリジナルならtrue
	//
	//------------------------------------------------------------------------------
	bool IsOriginal() const;
private:
	ID3D11Buffer* m_pVertexBuffer;

	ID3D11ShaderResourceView*		m_pShaderResourceView;

	unsigned int m_height;
	unsigned int m_width;

	bool m_bClone;
	//------------------------------------------------------------------------------
	//
	//  @brief		テクスチャを読み込む
	//	@param[in]	pFilepath	テクスチャのファイルパス
	//	@return		テクスチャの読み込みの成否
	//
	//------------------------------------------------------------------------------
	bool LoadTexture(const char* pFilepath);

	//------------------------------------------------------------------------------
	//
	//  @brief		頂点情報を作成する
	//	@param[in]	pContext	コンテキスト
	//	@param[in]	renderPos	画面に描画する範囲	
	//	@param[in]	texturePos	描画する画像の範囲
	//
	//------------------------------------------------------------------------------
	void CreateVertex(ID3D11DeviceContext* pContext, const DX::tagRect& renderPos, const DX::tagRect& texturePos, bool isMirror = false);

};

#endif // !__DX_2DOBJECT_H_
