#ifndef __DX_GRAPHICS_H_
#define __DX_GRAPHICS_H_

//****************************************************************************************************
//
//	Graphics
//
//****************************************************************************************************
class DX_Graphics
{
public:
	//------------------------------------------------------------------------------
	//
	//  @brief		自身のインスタンスを取得する
	//	@return		インスタンス
	//
	//------------------------------------------------------------------------------
	static DX_Graphics* GetInstance();

	//------------------------------------------------------------------------------
	//
	//  @brief		Graphicsを初期化する
	//
	//------------------------------------------------------------------------------
	void Initialize();

	//------------------------------------------------------------------------------
	//
	//  @brief		インスタンスの開放を行う
	//
	//------------------------------------------------------------------------------
	static void Release();

	//------------------------------------------------------------------------------
	//
	//  @brief		描画開始
	//	@param[in]	pSwapChain DX_System::GetSwapChain()
	//
	//------------------------------------------------------------------------------
	void BeginRender(IDXGISwapChain* pSwapChain);

	//------------------------------------------------------------------------------
	//
	//  @brief		描画終了
	//	@param[in]	pSwapChain DX_System::GetSwapChain()
	//
	//------------------------------------------------------------------------------
	void EndRender(IDXGISwapChain* pSwapChain);

	//------------------------------------------------------------------------------
	//
	//  @brief		リフレッシュシートの分母を取得
	//	@return		m_refreshRateN
	//
	//------------------------------------------------------------------------------
	unsigned int GetRefreshRateN() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		リフレッシュシートの分母を取得
	//	@return		m_refreshRateD
	//
	//------------------------------------------------------------------------------
	unsigned int GetRefreshRateD() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		ビデオカードのメモリ量の取得
	//	@return		m_videoCardMemory
	//
	//------------------------------------------------------------------------------
	unsigned int GetVieoCardMemory() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		ビデオカードのメモリ量の取得
	//	@return		m_videoCardDescription
	//
	//------------------------------------------------------------------------------
	const char* GetVideoCardDescription() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		スキャンラインオーダーを取得
	//	@return		m_scanlineOrder
	//
	//------------------------------------------------------------------------------
	DXGI_MODE_SCANLINE_ORDER GetScanLineOrder();

	//------------------------------------------------------------------------------
	//
	//  @brief		スケーリングを取得
	//	@return		m_scaling
	//
	//------------------------------------------------------------------------------
	DXGI_MODE_SCALING GetScaling();

	//------------------------------------------------------------------------------
	//
	//  @brief		フォーマット取得
	//	@return		m_format
	//
	//------------------------------------------------------------------------------
	DXGI_FORMAT	GetFortmat();

private:
	static DX_Graphics* m_pInstance;

	//	画面が開かれている時だけ描画を行うためのフラグ
	bool m_stand_by_mode;

	//	リフレッシュシートの分母と分子
	unsigned int m_refreshRateN;	//	分子 nolecule
	unsigned int m_refreshRateD;	//	分母 denominator

	//	ビデオカードのメモリ量			
	unsigned int m_videoCardMemory;

	//	ビデオカードの名前
	char m_videoCardDescription[128];

	//	スキャンライン
	DXGI_MODE_SCANLINE_ORDER m_scanlineOrder;

	//	スケーリング
	DXGI_MODE_SCALING		m_scaling;

	//	フォーマット
	DXGI_FORMAT				m_format;


	//------------------------------------------------------------------------------
	//
	//  @brief		コンストラクタ
	//
	//------------------------------------------------------------------------------
	DX_Graphics();

	//------------------------------------------------------------------------------
	//
	//  @brief		何もしない
	//
	//------------------------------------------------------------------------------
	~DX_Graphics() {}

};
#endif // !__DX_GRAPHICS_H_
