#ifndef __DX_INSTANCE_2DOBJECT_H_
#define __DX_INSTANCE_2DOBJECT_H_

//------------------------------------------------------------------------------
//
// 2DObjectをインスタンス描画する
// 画像サイズが大きいほど描画負荷がかかるので、そこには気を付けて下さい
//
//------------------------------------------------------------------------------
class DX_Instance2DObject
{
public:
	//------------------------------------------------------------------------------
	//
	//  @brief		メンバー変数の初期化
	//
	//------------------------------------------------------------------------------
	DX_Instance2DObject();

	//------------------------------------------------------------------------------
	//
	//  @brief		メンバー変数を初期化し、2DObjectを作成する
	//	@param[in]	pFilepath	テクスチャのファイルパス
	//	@param[in]	num			インスタンス数
	//	@param[in]	renderSize	描画するサイズ
	//
	//------------------------------------------------------------------------------
	DX_Instance2DObject(const char* pFilepath, const size_t num, const DirectX::XMFLOAT2& renderSize);

	//------------------------------------------------------------------------------
	//
	//  @brief		デストラクタ
	//
	//------------------------------------------------------------------------------
	~DX_Instance2DObject();

	//------------------------------------------------------------------------------
	//
	//  @brief		座標一覧を取得する
	//	@return		座標一覧
	//
	//------------------------------------------------------------------------------
	DirectX::XMFLOAT3* GetPosList();

	//------------------------------------------------------------------------------
	//
	//  @brief		座標一覧を取得する
	//	@param[in]	index 指定した箇所からの座標一覧を取得する
	//	@return		座標一覧
	//
	//------------------------------------------------------------------------------
	DirectX::XMFLOAT3* GetPosList(const unsigned int index);

	//------------------------------------------------------------------------------
	//
	//  @brief		テクスチャを読み込む
	//	@param[in]	pFilepath	テクスチャのファイルパス
	//
	//------------------------------------------------------------------------------
	void LoadTexture(const char* pFilepath);

	//------------------------------------------------------------------------------
	//
	//  @brief		描画する
	//
	//------------------------------------------------------------------------------
	void Render();
private:
	//	テクスチャ情報
	ID3D11ShaderResourceView*		m_pShaderResourceView;
	ID3D11Buffer* m_pVertexBuffer;

	size_t m_width;
	size_t m_height;
	size_t m_instanceNum;
	DirectX::XMFLOAT3* m_pPosList;
};
#endif // !__DX_INSTANCE_2DOBJECT_H_
