#ifndef __DX_RENDER_STATE_H_
#define __DX_RENDER_STATE_H_



//****************************************************************************************************
//
//	RenderState
//
//****************************************************************************************************
class DX_RenderState
{
public:
	//------------------------------------------------------------------------------
	//
	//  @brief		インスタンスを取得する
	//
	//------------------------------------------------------------------------------
	static DX_RenderState* GetInstance();

	//------------------------------------------------------------------------------
	//
	//  @brief		インスタンスを解放する
	//
	//------------------------------------------------------------------------------
	static void Release();

	//------------------------------------------------------------------------------
	//
	//  @brief		初期描画の設定を行う
	//
	//------------------------------------------------------------------------------
	static void Initialize(ID3D11Device* pDevice);

	//------------------------------------------------------------------------------
	//
	//  @brief		デフォルトのラスタライズステートを取得する
	//
	//------------------------------------------------------------------------------
	ID3D11RasterizerState* GetDefaultRasterizerState() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		デフォルトのブレンドステートを取得する
	//
	//------------------------------------------------------------------------------
	ID3D11BlendState* GetDefaultBlendState() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		デフォルトの深度ステンシルステートを取得する
	//
	//------------------------------------------------------------------------------
	ID3D11DepthStencilState* GetDefaultDepthStencilState() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		デフォルトのサンプルステートを取得する
	//
	//------------------------------------------------------------------------------
	ID3D11SamplerState* GetDefaultSamplerState() const;

private:
	static DX_RenderState*		m_pInstance;

	ID3D11RasterizerState*		m_pRasterizerState;
	ID3D11BlendState*			m_pBlendState;
	ID3D11DepthStencilState*	m_pDepthStencilState;
	ID3D11SamplerState*			m_pSamplerState;

	//------------------------------------------------------------------------------
	//
	//  @brief		初期化する
	//
	//------------------------------------------------------------------------------
	DX_RenderState();

	//------------------------------------------------------------------------------
	//
	//  @brief		解放する
	//
	//------------------------------------------------------------------------------
	~DX_RenderState();

	//------------------------------------------------------------------------------
	//
	//  @brief		ラスタライザステートを作成する
	//	@param[in]	pDevice	DX_System::GetDevice()
	//	@return		ラスタライザステート
	//
	//------------------------------------------------------------------------------
	void CreateRasterizerState(ID3D11Device* pDevice);

	//------------------------------------------------------------------------------
	//
	//  @brief		ブレンドステートを作成する
	//	@param[in]	pDevice	DX_System::GetDevice()
	//	@return		ブレンドステート
	//
	//------------------------------------------------------------------------------
	void CreateBlendState(ID3D11Device* pDevice);

	//------------------------------------------------------------------------------
	//
	//  @brief		深度･ステンシルステートを作成する
	//	@param[in]	pDevice	DX_System::GetDevice()
	//	@return		深度ステンシルステート
	//
	//------------------------------------------------------------------------------
	void CreateDepthStencilState(ID3D11Device* pDevice);

	//------------------------------------------------------------------------------
	//
	//  @brief		サンプラーステートを作成する
	//	@param[in]	pDevice	DX_System::GetDevice()
	//	@return		サンプラーステート
	//
	//------------------------------------------------------------------------------
	void CreateSamplerState(ID3D11Device* pDevice);
};
#endif // !__DX_RENDER_STATE_H_
