#ifndef __DX_RENDER_STATE_H_
#define __DX_RENDER_STATE_H_

//****************************************************************************************************
//
//	RenderState
//
//****************************************************************************************************
class DX_RenderState : public DX_Singleton<DX_RenderState>
{
	friend class DX_Singleton<DX_RenderState>;
public:
	//------------------------------------------------------------------------------
	//
	//  @brief		初期描画の設定を行う
	//
	//------------------------------------------------------------------------------
	bool Initialize();

	//------------------------------------------------------------------------------
	//
	//  @brief		ラスタライザステートを取得する
	//	@return		ラスタライザステート
	//
	//------------------------------------------------------------------------------
	ID3D11RasterizerState* GetDefaultRasterizerState();

	//------------------------------------------------------------------------------
	//
	//  @brief		ブレンドステートを取得する
	//	@return		ブレンドステート
	//
	//------------------------------------------------------------------------------
	ID3D11BlendState* GetDefaultBlendState();

	//------------------------------------------------------------------------------
	//
	//  @brief		深度/ステンシルステートを取得する
	//	@return		深度/ステンシルステート
	//
	//------------------------------------------------------------------------------
	ID3D11DepthStencilState* GetDefaultDepthStencilState();

	//------------------------------------------------------------------------------
	//
	//  @brief		サンプラステートを取得する
	//	@return		サンプラステート
	//
	//------------------------------------------------------------------------------
	ID3D11SamplerState* GetDefaultSamplerState();

#if defined(DEBUG) || defined(_DEBUG)
	//------------------------------------------------------------------------------
	//
	//  @brief		ラスタライザをソリッド描画に切り替える
	//
	//------------------------------------------------------------------------------
	void SwitchSolidRS();

	//------------------------------------------------------------------------------
	//
	//  @brief		ラスタライザをワイヤーフレーム描画に切り替える
	//
	//------------------------------------------------------------------------------
	void SwitchWireframeRS();
#endif

private:
	Microsoft::WRL::ComPtr<ID3D11RasterizerState>	m_rasterizerState;
	Microsoft::WRL::ComPtr<ID3D11BlendState>		m_blendState;
	Microsoft::WRL::ComPtr<ID3D11DepthStencilState>	m_depthStencilState;
	Microsoft::WRL::ComPtr<ID3D11SamplerState>		m_samplerState;


	//------------------------------------------------------------------------------
	//
	//  @brief		ラスタライザーステートを作成する
	//	@param[in]	pDevice	DX_System::GetDevice()
	//
	//------------------------------------------------------------------------------
	bool CreateRasterizerState(ID3D11Device* pDevice);

	//------------------------------------------------------------------------------
	//
	//  @brief		ブレンドステートを作成する
	//	@param[in]	pDevice	DX_System::GetDevice()
	//
	//------------------------------------------------------------------------------
	 bool CreateBlendState(ID3D11Device* pDevice);

	//------------------------------------------------------------------------------
	//
	//  @brief		深度･ステンシルステートを作成する
	//	@param[in]	pDevice	DX_System::GetDevice()
	//
	//------------------------------------------------------------------------------
	bool CreateDepthStencilState(ID3D11Device* pDevice);

	//------------------------------------------------------------------------------
	//
	//  @brief		サンプラーステートを作成する
	//	@param[in]	pDevice	DX_System::GetDevice()
	//
	//------------------------------------------------------------------------------
	bool CreateSamplerState(ID3D11Device* pDevice);
#if defined(DEBUG) || defined(_DEBUG)
	Microsoft::WRL::ComPtr<ID3D11RasterizerState>	m_wireFrameRS;
#endif
};
#endif // !__DX_RENDER_STATE_H_
