#ifndef __DX_SCENE_H_
#define __DX_SCENE_H_


//****************************************************************************************************
//
//	Scene
//
//****************************************************************************************************
class DX_Scene
{
private:
public:
	//------------------------------------------------------------------------------
	//
	//  @brief		何もしない
	//
	//------------------------------------------------------------------------------
	virtual ~DX_Scene(){};

	//------------------------------------------------------------------------------
	//
	//  @brief		純粋仮想関数	初期化
	//	@return		true:成功	false:失敗
	//
	//------------------------------------------------------------------------------
	virtual bool Initialize() = 0;
	
	//------------------------------------------------------------------------------
	//
	//  @brief		純粋仮想関数	更新
	//	@return		true:成功	false:失敗
	//
	//------------------------------------------------------------------------------
	virtual bool Update(DX_System* pSystem, ID3D11Device* pDevice, ID3D11DeviceContext* pContext) = 0;
	
	//------------------------------------------------------------------------------
	//
	//  @brief		純粋仮想関数	描画
	//
	//------------------------------------------------------------------------------
	virtual void Render(DX_System* pSystem, ID3D11Device* pDevice, ID3D11DeviceContext* pContext) = 0;

};



//****************************************************************************************************
//
//	NullScene
//
//****************************************************************************************************
class DX_NullScene : public DX_Scene
{
public:
	bool Initialize(){ return true; }
	bool Update(DX_System* pSystem, ID3D11Device* pDevice, ID3D11DeviceContext* pContext){ return true; }
	void Render(DX_System* pSystem, ID3D11Device* pDevice, ID3D11DeviceContext* pContext){}


};


#endif // !__DX_SCENE_H_
