#include	"DX_Library.h"

//-----------------------------------------------------------------------------------------
//
//	staticメンバ変数
//
//-----------------------------------------------------------------------------------------
DX_Scene*	DX_SceneManager::m_pCurScene = nullptr;
DX_Scene*	DX_SceneManager::m_pNextScene = nullptr;


//-----------------------------------------------------------------------------------------
//
//	メンバー変数を初期化する
//
//-----------------------------------------------------------------------------------------
void DX_SceneManager::Initialize(DX_Scene*	pCurScene)
{
	//	現在のシーンを設定
	m_pCurScene = pCurScene;
}
void DX_SceneManager::Release()
{
	DELETE_OBJ(m_pCurScene);
	DELETE_OBJ(m_pNextScene);
	
}
//-----------------------------------------------------------------------------------------
//
//	現在のシーンを取得する
//
//-----------------------------------------------------------------------------------------
DX_Scene* DX_SceneManager::GetCurScene()
{
	return m_pCurScene;
}