#ifndef __DX_TEXTURE_H_
#define __DX_TEXTURE_H_


//****************************************************************************************************
//
//	DX_TextureManager
//
//****************************************************************************************************
class DX_TextureManager
{
public:
	//------------------------------------------------------------------------------
	//
	//  @brief		インスタンスを取得する
	//	@return		インスタンス
	//
	//------------------------------------------------------------------------------
	static DX_TextureManager* GetInstance();

	//------------------------------------------------------------------------------
	//
	//  @brief		インスタンスを解放する
	//
	//------------------------------------------------------------------------------
	static void Release();

	//------------------------------------------------------------------------------
	//
	//  @brief		テクスチャをロードする
	//	@param[in]	pFilepath	テクスチャのファイルパス
	//	@return		テクスチャ情報
	//
	//------------------------------------------------------------------------------
	ID3D11ShaderResourceView* GetTexture(const char* pFilepath);
	
	//------------------------------------------------------------------------------
	//
	//  @brief		テクスチャを解放
	//	@param[in]	pTexture 使用したテクスチャ
	//
	//------------------------------------------------------------------------------
	void Release(ID3D11ShaderResourceView* pTexture);

private:
	static DX_TextureManager* m_pInstance;
	struct TextureInfo {
		char filepath[_MAX_PATH];
		ID3D11ShaderResourceView* pSrv;
	};
	static const int TEXTURE_NUM = 100;

	//	テクスチャ情報を格納
	TextureInfo m_textureList[TEXTURE_NUM];

	//------------------------------------------------------------------------------
	//
	//  @brief		初期化
	//
	//------------------------------------------------------------------------------
	DX_TextureManager();

	//------------------------------------------------------------------------------
	//
	//  @brief		解放
	//
	//------------------------------------------------------------------------------
	~DX_TextureManager();

	//------------------------------------------------------------------------------
	//
	//  @brief		テクスチャを使用しているかを調べる
	//	@param[in]	pfilepath エクスチャのファイルパス
	//	@return		発見:ポインタ	未発見:nullptr
	//
	//------------------------------------------------------------------------------
	ID3D11ShaderResourceView* SearchTexture(const char* pfilepath);
};
#endif // !__DX_TEXTURE_H_
