#ifndef __DX_TEXTURE_H_
#define __DX_TEXTURE_H_


//****************************************************************************************************
//
//	DX_TextureManager
//
//****************************************************************************************************
class DX_TextureManager
{
public:
	//------------------------------------------------------------------------------
	//
	//  @brief		変数を初期化
	//
	//------------------------------------------------------------------------------
	static void Initialize();

	//------------------------------------------------------------------------------
	//
	//  @brief		テクスチャをロードする
	//	@param[in]	pFilepath	テクスチャのファイルパス
	//	@return		テクスチャ情報
	//
	//------------------------------------------------------------------------------
	static ID3D11ShaderResourceView* GetTexture(const char* pFilepath);
	
	//------------------------------------------------------------------------------
	//
	//  @brief		テクスチャをサイズを取得する
	//	@param[in]	width	テクスチャサイズ(幅)が格納される
	//	@param[in]	height	テクスチャサイズ(高さ)が格納される
	//	@param[in]	pSrv	テクスチャ情報
	//
	//------------------------------------------------------------------------------
	static void GetTextureSize(UINT* width, UINT* height, const ID3D11ShaderResourceView* pSrv);

	//------------------------------------------------------------------------------
	//
	//  @brief		テクスチャを解放
	//	@param[in]	pTexture 使用したテクスチャ
	//
	//------------------------------------------------------------------------------
	static void Release(ID3D11ShaderResourceView* pTexture);

	//------------------------------------------------------------------------------
	//
	//  @brief		テクスチャを全解放
	//
	//------------------------------------------------------------------------------
	static void AllRelease();

private:
	static const int TEXTURE_NUM = 100;

	//	テクスチャ情報を格納
	static DX::tagTextureInfo m_textures[TEXTURE_NUM];

	//------------------------------------------------------------------------------
	//
	//  @brief		テクスチャを使用しているかを調べる
	//	@param[in]	pfilepath エクスチャのファイルパス
	//	@return		発見:ポインタ	未発見:nullptr
	//
	//------------------------------------------------------------------------------
	static ID3D11ShaderResourceView* SearchTexture(const char* pfilepath);
};
#endif // !__DX_TEXTURE_H_
