#pragma once

/// <summary>
/// ボタン機能のある2DOBject
/// </summary>
class Button : public Object2D
{
public:
	Button();

	~Button();
	//------------------------------------------------------------------------------
	//
	//  @brief		画像の上でクリックしたかどうか
	//	@return		クリックしたならtrue
	//
	//------------------------------------------------------------------------------
	bool IsClick() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		画像の上でクリックしている最中かどうか
	//	@return		クリックしている最中ならtrue
	//
	//------------------------------------------------------------------------------
	bool IsClickDown() const;

	//------------------------------------------------------------------------------
	//
	//  @brief		画像の上でクリックをしたあとかどうか
	//	@return		クリックしたあとならtrue
	//
	//------------------------------------------------------------------------------
	bool IsClickRelease() const;

private:
	DX_Input* m_input;
	//------------------------------------------------------------------------------
	//
	//  @brief		画像の上にマウスポインタがあるかどうか
	//	@return		あるならtrue
	//
	//------------------------------------------------------------------------------
	bool IsInRect() const;
};